Revit 2026 API

# DisplacementElementCanElementsBeDisplaced(View, ICollectionElementId, ElementId) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool CanElementsBeDisplaced(
	View view,
	ICollection<ElementId> elementIds,
	out ElementId commonDisplacedElementId
)
```
```vb
Public Shared Function CanElementsBeDisplaced (
	view As View,
	elementIds As ICollection(Of ElementId),
	<OutAttribute> ByRef commonDisplacedElementId As ElementId
) As Boolean
```
```cpp
public:
static bool CanElementsBeDisplaced(
	View^ view,
	ICollection<ElementId^>^ elementIds,
	[OutAttribute] ElementId^% commonDisplacedElementId
)
```
```fsharp
static member CanElementsBeDisplaced :
        view : View *
        elementIds : ICollection<ElementId> *
        commonDisplacedElementId : ElementId byref -> bool
```

#### Parameters

view View

elementIds ICollectionElementId

commonDisplacedElementId ElementId

#### Return Value

Boolean

#### Reference

DisplacementElement Class

CanElementsBeDisplaced Overload

Autodesk.Revit.DB Namespace